tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "johnothwolo/smcfancontrol", "https://github.com/johnothwolo/smcFanControl"
tap "superfly/tap"
tap "zachauten/taps", "https://github.com/zachauten/homebrew-taps.git"
# Simple, modern, secure file encryption
brew "age"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Programmable completion for Bash 3.2
brew "bash-completion"
# GNU binary tools for native development
brew "binutils"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Top-like interface for container metrics
brew "ctop"
# Portable devkit for CI/CD pipelines
brew "dagger"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line DNS client
brew "dog"
# C string library for manipulating Unicode strings
brew "libunistring"
# OpenType text shaping engine
brew "harfbuzz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@16"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# Emulator for x86 and PowerPC
brew "qemu"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer
brew "tmux"
# Download YouTube videos from the command-line
brew "youtube-dl"
brew "superfly/tap/flyctl"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web security testing toolkit
cask "burp-suite"
# Free and open-source web browser
cask "chromium"
# App to build and share containerized applications and microservices
cask "docker"
# Matrix collaboration client
cask "element"
# Web browser
cask "firefox"
# Open-source software for live streaming and screen recording
cask "obs"
# Team communication and collaboration software
cask "slack"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Open-source BitTorrent client
cask "transmission"
# Set up, configure, manage and analyze your UniFi network
cask "ubiquiti-unifi-controller"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Network protocol analyzer
cask "wireshark"
